{-# LANGUAGE ScopedTypeVariables #-}
-- Лабораторна робота №1
-- студентка групи АнД-31
-- Варіант 5
-- Завдання 1.  Наведiть приклади виразiв вказаного типу.([Char],[Double],[(Bool,Integer)])
-- [Char] : j, k, /
-- [Double] : 2+3/4, 5/10
-- [(Bool,Integer)] : [(True, 3)], [(False, 10)]

-- Завдання 2. Визначте два варiанти вказаних далi функцiй:
--  Функцiя визначає, чи належить кругу дана точка. Точка задається координатами, круг – координатами центра та радiусом.

f1' :: (Integer, Integer, Integer) -> Integer
 f1' (x,y,r) = if x^2 + y^2 <r^2 then 1 
                                else 0 


