{-# LANGUAGE ScopedTypeVariables #-}
-- Лабораторна робота №2
-- студентка групи АнД-31
-- Кузьменко Анастасія
-- Варіант 5
-- Мета роботи:Набути досвiду визначення рекурсивних функцiй, використання механiзму зiставлення зi зразком i роботи з кортежами та списками.
--Завдання 1.Чи є список палiндромом?
isPalindrome :: Eq a => [a] -> Bool
isPalindrome []  = True
isPalindrome [_] = True
isPalindrome xs  = (head xs == last xs) && (isPalindrome (tail (init xs)))
--Завдання 2. Oб’єднання зi змiшуванням двох спискiв.
f1 x y = zip x y 

-- Для тестування коду слід виконати наступні команди: Завдання 1:isPalindrome [1,2,1], isPalindrome [1,2,1,1]. Завдання 2: f1 [1,2,3] ['a','b'], f1 [1,2,3] [4,5,6].
-- Висновок: Ми навчилися користуватися списками та вбудованими функціями.