-- Лабораторна робота №3
-- студентка групи АнД-31
-- Кузьменко Анастасія
-- Варіант 5
-- Мета роботи:Набути досвiду визначення та використання функцiй вищого порядку.
--Завдання 1:Знайти найбiльший спiльний дiльник двох чисел.
--З вбудованими функціями:
f1 :: Int->Int->Int
f1 x y = gcd x y 
--Без вбудованих:
f2 a b = ((max a b) `mod` (min a b)) (min a b)
-- Для тестування коду слід виконати наступні команди: f1 12 4, f2 32 16.
-- Висновок: Ми навчилися використовувати функції вищого порядку та вирішувати задачі без них.